Revit 2026 API

# ParameterTypeIdRbsEnergyAnalysisSurfaceOriginY Property

---

"Origin (Y)"

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ForgeTypeId RbsEnergyAnalysisSurfaceOriginY { get; }
```
```vb
Public Shared ReadOnly Property RbsEnergyAnalysisSurfaceOriginY As ForgeTypeId
	Get
```
```cpp
public:
static property ForgeTypeId^ RbsEnergyAnalysisSurfaceOriginY {
	ForgeTypeId^ get ();
}
```
```fsharp
static member RbsEnergyAnalysisSurfaceOriginY : ForgeTypeId with get
```

#### Property Value

ForgeTypeId

#### Reference

ParameterTypeId Class

Autodesk.Revit.DB Namespace